Repository: iconindicators/appindicators
Catalog: indicatortide/src/indicatortide/locale/*/LC_MESSAGES/indicatortide.po
Languages: ru

source: Indicator Tide
ru: Индикатор приливов

source: Displays tidal information.
ru: Показывает сведения о приливах.

source: No user script specified!
ru: Пользовательский сценарий не задан!

source: Specify a user script and class name in the preferences.
ru: Задайте пользовательский сценарий и имя класса в Параметрах.

source: User script could not be found!
ru: Пользовательский сценарий не найден!

source: Check the user script in the preferences.
ru: Проверьте настройку пользовательского сценария в Параметрах.

source: User script class name could not be found!
ru: Имя класса в пользовательском сценарии не найдено!

source: Check the user script class name in the preferences.
ru: Проверьте настройку имени класса в Параметрах.

source: User function could not be found!
ru: Пользовательская функция не найдена!

source: You must implement the function 'get_tide_data()'.
ru: Вы должны внедрить функцию 'get_tide_data()'.

source: HIGH
ru: ПРИЛИВ

source: LOW
ru: ОТЛИВ

source: User Script
ru: Пользовательский сценарий

source: Full path and filename of user's Python3 script.
ru: Полный путь и имя файла пользовательского сценария Python3.

source: Path and filename
ru: Путь и имя файла

source: Class name within the user script which must contain the function get_tide_data() implemented by the user to obtain the tidal data.
ru: Имя класса в пользовательском сценарии, которое должно содержать функцию get_tide_data() разработанную пользователем, для получения данных о приливах.

source: Class name
ru: Имя класса

source: Show as submenus
ru: Отображать подменю

source: Show each day's tides in a submenu.
ru: Отображать приливы каждого дня в виде подменю.

source: Except first day
ru: Кроме первого дня

source: Show the first day's tide in full.
ru: Отображать приливы первого дня полностью.

source: The user script path/filename cannot be found.
ru: Пользовательский сценарий с заданным именем не найден.

source: The user script path/filename cannot be empty.
ru: Имя пользовательского сценария не может быть пустым.

source: The user script class name cannot be empty.
ru: Имя класса в пользовательском сценарии не может быть пустым.
