Repository: iconindicators/appindicators
Catalog: indicator-fortune/po/*/indicator-fortune.po
Languages: ru

source: Fortune. . .
ru: Изречение. . .

source: Calls the 'fortune' program displaying the result in the on-screen notification.
ru: Вызывает программу 'fortune', показывающую изречения в виде всплывающих сообщений.

source: New Fortune
ru: Новое изречение

source: Copy Last Fortune
ru: Скопировать последнее

source: Show Last Fortune
ru: Показать последнее

source: History
ru: История

source: Fortune History for Session
ru: История изречений

source: No enabled fortunes have a valid location!
ru: Неверно заданы пути у включённых файлов изречений!

source: Ensure enabled fortunes contain fortune data!
ru: Убедитесь в правильности формата файлов включённых изречений!

source: WARNING. . .
ru: ПРЕДУПРЕЖДЕНИЕ. . .

source: Fortune File/Directory
ru: Файл/Папка с изречениями

source: Enabled
ru: Включен

source: Double click to edit a fortune. English language fortunes are installed by default. There may be other fortune packages available in your native language.
ru: Щёлкните дважды, чтобы отредактировать свойства. По умолчанию установлен пакет англоязычных изречений. Другие пакеты с изречениями могут быть доступны на вашем родном языке.

source: Add
ru: Добавить

source: Add a new fortune location.
ru: Добавить новые изречения.

source: Remove
ru: Удалить

source: Remove the selected fortune location.
ru: Удалить выбранные изречения.

source: Reset
ru: Сброс

source: Reset to factory default.
ru: Сбросить к начальным настройкам.

source: Fortunes
ru: Файлы изречений

source: Refresh interval (minutes)
ru: Интервал обновления (в минутах)

source: How often a fortune is displayed.
ru: Насколько часто показываются изречения.

source: Notification summary
ru: Заголовок сообщения

source: The summary text for the notification.
ru: Текст заголовка всплывающего сообщения.

source: Message character limit
ru: Лимит количества символов

source: If the fortune exceeds the limit, a new fortune is created. Do not set too low (below 50) as many fortunes may be dropped, resulting in excessive calls to the 'fortune' program.
ru: Если длина изречения превышает лимит, то будет создано новое изречение. Не задавайте слишком низкий лимит (меньше 50), так как многие изречения будут отброшены, что вызовет чрезмерное обращение к программе 'fortune'.

source: Middle mouse click of the icon
ru: Щелчок средней кнопкой мыши по значку

source: Not supported on all versions/derivatives of Ubuntu.
ru: Поддерживается не во всех версиях/производных Ubuntu.

source: Show a new fortune
ru: Показать новое изречение

source: Copy current fortune to clipboard
ru: Скопировать последнее изречение в буфер

source: Show current fortune
ru: Показать последнее изречение

source: General
ru: Общие

source: Reset fortunes to factory default?
ru: Очистить список и вернуть начальные настройки?

source: No fortune has been selected for removal.
ru: Не выбран элемент списка для удаления.

source: This is the default fortune and cannot be deleted.
ru: Стандартный файл с изречениями не может быть удалён.

source: Remove the selected fortune?
ru: Удалить выбранный элемент?

source: Fortune file/directory
ru: Файл/папка с изречениями

source: The path to a fortune .dat file, or a directory containing fortune .dat files. Ensure the corresponding fortune text file(s) is present.
ru: Путь к файлу .dat с изречениями или к папке, содержащей файлы .dat с изречениями. Убедитесь, что надлежащие текстовые файлы существуют.

source: File
ru: Файл

source: This fortune is part of your system and cannot be modified.
ru: Этот файл с изречениями является частью системы и не может быть изменён.

source: Choose a fortune .dat file. Ensure the corresponding text file is present.
ru: Выберите файл .dat с изречениями. Убедитесь, что надлежащий текстовый файл существует.

source: Directory
ru: Папка

source: Choose a directory containing a fortune .dat file(s). Ensure the corresponding text file is present.
ru: Выберите папку, содержащую файлы .dat с изречениями. Убедитесь, что надлежащие текстовые файлы существуют.

source: Ensure the fortune file/directory works by running through 'fortune' in a terminal.
ru: Убедитесь, что файл/папка с изречениями работает, используя команду 'fortune' в терминале.

source: Add Fortune
ru: Добавить изречения

source: Edit Fortune
ru: Редактировать свойства

source: The fortune path cannot be empty.
ru: Путь не может быть пустым.

source: Choose a directory containing a fortune .dat file(s)
ru: Выберите папку, содержащую файл(ы) .dat с изречениями

source: Choose a fortune .dat file
ru: Выберите файл .dat с изречениями

source: The fortune is part of your system and is already included.
ru: Этот файл с изречениями является частью системы и уже подключён.
