Repository: iconindicators/appindicators
Catalog: indicator-on-this-day/po/*/indicator-on-this-day.po
Languages: ru

source: EVENT
ru: СОБЫТИЕ

source: Calls the 'calendar' program and displays events in the menu.
ru: Вызывает программу 'calendar' и показывает события в меню.

source: On this day...
ru: В этот день...

source: Calendar
ru: Календарь

source: Enabled
ru: Включен

source: Double click to edit a calendar.
ru: Щёлкните дважды, чтобы отредактировать календарь.

source: Add
ru: Добавить

source: Add a new calendar.
ru: Добавить новый календарь.

source: Remove
ru: Удалить

source: Remove the selected calendar.
ru: Удалить выбранный календарь.

source: Reset
ru: Сбросить

source: Reset to factory default.
ru: Сбросить к начальным настройкам.

source: Calendars
ru: Календари

source: Lines
ru: Строки

source: The number of menu items available for display.
ru: Количество строк событий, отображаемых в меню.

source: On event click
ru: При щелчке по событию

source: Copy event to clipboard
ru: Скопировать событие в буфер

source: Copy the event text and date to the clipboard.
ru: Скопировать событие и его дату в буфер обмена.

source: Search event on the internet
ru: Искать событие в Интернет

source: Open the default web browser and search for the event.
ru: Открыть обозреватель по умолчанию и искать событие.

source: URL
ru: Ссылка

source: The URL to search for the event. Use {0} in the URL to specify the position of the event text/date. If the URL is empty and 'search' is selected, the search will effectively be ignored. If the URL is empty and 'copy' is selected, the URL is reset back to factory default.
ru: Ссылка для поиска события. Используйте {0} в ссылке, чтобы задать позицию текста и даты события при поиске. Если ссылка пустая, и задана опция "Искать", то поиск будет игнорироваться. Если ссылка пустая, и задана опция "Скопировать", то будет восстановлена ссылка по умолчанию.

source: Notify
ru: Уведомлять

source: On startup or when saving preferences, show a notification for each of today's events.
ru: При запуске или сохранении настроек показывать уведомление о всех событиях текущего дня.

source: General
ru: Общие

source: Reset calendars to factory default?
ru: Сбросить календари к начальным настройкам?

source: No calendar has been selected.
ru: Ни один календарь не выбран.

source: This calendar is part of your system and cannot be removed.
ru: Этот календарь является системным и не может быть удалён.

source: Remove the selected calendar?
ru: Удалить выбранный календарь?

source: Calendar file
ru: Файл календаря

source: The path to a calendar file.
ru: Путь к файлу календаря.

source: Browse
ru: Обзор

source: This calendar is part of your system and cannot be modified.
ru: Этот календарь является системным и не может быть изменён.

source: Choose a calendar file. Ensure the calendar file is valid by running through 'calendar' in a terminal.
ru: Выберите файл календаря. Убедитесь, что файл календаря имеет правильный формат, запустив его с помощью команды 'calendar' в терминале.

source: Add Calendar
ru: Добавить календарь

source: Edit Calendar
ru: Изменить календарь

source: The calendar path cannot be empty.
ru: Путь к файлу календаря не может быть пустым.

source: The calendar path does not exist.
ru: Путь к календарю не существует.

source: Choose a calendar file
ru: Выберите файл календаря

source: The calendar is part of your system and is already included.
ru: Этот календарь является системным и уже существует в списке.
