Repository: iconindicators/appindicators
Catalog: indicator-punycode/po/*/indicator-punycode.po
Languages: ru

source: Convert domain names between Unicode and ASCII.
ru: Преобразователь доменных имён, содержащих символы Уникода.

source: Convert
ru: Преобразовать

source: Unicode:
ru: Уникод:

source: No text is in the clipboard.
ru: Буфер обмена пуст.

source: No text is highlighted/selected.
ru: Буфер выделения пуст.

source: Nothing to convert...
ru: Преобразование невозможно...

source: Error converting...
ru: Ошибка преобразования...

source: See log for more details.
ru: Подробности в журнале.

source: Input source
ru: Источник данных

source: Clipboard
ru: Буфер обмена

source: Input is taken from the clipboard after a CTRL-X or CTRL-C (or equivalent).
ru: Данные вводятся при помощи Ctrl-C или пункта "Копировать" в контекстном меню.

source: Primary
ru: Буфер выделения

source: Input is taken from the currently selected text after a middle mouse click of the indicator icon.
ru: Данные вводятся нажатием средней кнопки мыши на значок индикатора после выделения текста.

source: Output to clipboard and primary
ru: Поместить результат в оба буфера

source: If checked, the output text is sent to both the clipboard and primary. Otherwise the output is sent back only to the input source.
ru: Если стоит отметка, то результат помещается в оба буфера обмена. Иначе он помещается только в буфер, в котором содержались исходные данные.

source: Drop path/query in output
ru: Отбросить символы за доменным именем

source: If checked, the output text will not contain any path/query (if present).
ru: Если стоит отметка, все символы, следующие за доменным именем, будут отброшены.

source: Maximum results
ru: Количество результатов

source: The number of most recent results to show in the menu. Selecting a menu item which contains a result will copy the result to the output.
ru: Задаёт количество отображаемых в меню последних результатов. Нажатие на пункт меню, который содержит результат, поместит этот результат в буфер обмена.
