Repository: iconindicators/appindicators
Catalog: trunk/po/*/indicator-virtual-box.po
Languages: cs, ru

source: Shows VirtualBox™ virtual machines and allows them to be started.
cs: Zobrazuje virtuální stroje VirtualBox™ a umožňuje jejich start.

source: (no virtual machines exist)
cs: (neexistuje žádný virtuální stroj)
ru: (виртуальные машины не найдены)

source: Launch VirtualBox Manager
cs: Spustit VirtualBox Manager

source: (VirtualBox is not installed)
cs: (Virtualbox není nainstalován)

source: Missing VM... Name: {0} ID: {1}
cs: Chybějící VM... Jméno: {0} ID: {1}

source: The VM could not be found - either it has been renamed or deleted. The list of VMs has been refreshed - please try again.
cs: Není možno nalézt VM - Buď byl přejmenován nebo smazán. Seznam aktuálních VM byl aktualizován - zkuste to znovu.

source: The VM is running but its window could not be found - perhaps it is running headless.
cs: Virtuální stroj běží, ale jeho ohno se nedá nalézy - možná běží v režimu headless.

source: There is more than one VM with the same name - unfortunately your VM cannot be uniquely identified.
cs: Bohužel již existuje VM se stejným názvem - není možné pojmenovat další VM stejně.

source: The VM '{0}' could not be started - check the log file: {1}
cs: Stroj '{0}' nelze spustit - zkontrolujte soubor logu: {1}

source: translator-credits
cs: překladatel
ru: Олег Мойсейчук

source: Virtual Machine
cs: Virtuální stroj
ru: Виртуальная машина

source: Autostart
cs: Automatický start
ru: Автозапуск

source: Start Command
cs: Startovací příkaz
ru: Команда запуска

source: Double click to edit a VM's properties.
cs: Dvojklikem editujte nastavení stroje.

source: Virtual Machines
cs: Virtuální stroje
ru: Виртуальные машины

source: Show groups as submenus
cs: Skupiny jako podřízená menu
ru: Показывать подменю для групп

source: Groups can be shown with their VMs in submenus, or shown with their VMs as an indented list.
cs: Skupiny mohou být zobrazeny v podemnu, nebo tak jak je určeno v seznamu VM.

source: Sort VMs alphabetically
cs: Třídit stroje abecedně

source: VMs can be sorted alphabetically or as set in the VirtualBox Manager.
cs: VM mohou být setříděny dle abecedy nebo dle VirtualBox Manageru.

source: Refresh interval (minutes)
cs: Obnovovací interval (minuty)
ru: Интервал обновления (в минутах)

source: How often the list of VMs and running status is updated.
cs: Jak často je seznam VM aktualizován.

source: Startup delay (seconds)
cs: Zpoždění startu (sekundy)
ru: Задержка запуска (в секундах)

source: Amount of time to wait from starting one VM to the next.
cs: Časová prodleva před startem dalšího stroje.

source: Run the indicator automatically.
cs: Spustit indikátor automaticky.
ru: Запускать индикатор автоматически.

source: General
cs: Obecné
ru: Общие

source: Preferences
cs: Nastavení
ru: Параметры

source: The terminal command to start the VM such as 'VBoxManage startvm %VM%' or 'VBoxHeadless --startvm %VM% --vrde off'
cs: Příkaz z řádky ke spuštění VM stroje jako 'VBoxManage startvm %VM%' or 'VBoxHeadless --startvm %VM% --vrde off'

source: Run the VM when the indicator starts.
cs: Spustit VM po startu indikátoru.

source: VM Properties
cs: Vlastnosti stroje

source: The start command cannot be empty.
cs: Startovací příkaz nemůže být prázdný.
ru: Команда запуска не может быть пустой.

source: The start command must contain %VM% which is substituted for the VM name/id.
cs: Příkaz ke startu musí obsahovat %VM% kde je nahrazeno jméno VM stroje/id.

source: View the
cs: Zobrazit
ru: Просмотреть

source: changelog
cs: změnový
ru: список изменений

source: text file.
cs: textový soubor.

source: Shows VirtualBox™ virtual machines and allows them to be started.
ru: Показывает виртуальные машины VirtualBox™ и позволяет их запускать.

source: Launch VirtualBox™ Manager
ru: Запустить Менеджер VirtualBox

source: (VirtualBox™ is not installed)
ru: (VirtualBox не установлен)

source: The virtual machine could not be found - perhaps it has been renamed or deleted. The list of virtual machines has been refreshed - please try again.
ru: Виртуальная машина не найдена: возможно, она была переименована или удалена. Список виртуальных машин был обновлён - пожалуйста, повторите попытку.

source: Error
ru: Ошибка

source: Unable to find the window for the virtual machine '{0}' - perhaps it is running as headless.
ru: Не удалось найти окно виртуальной машины '{0}': вероятно, она запущена в автономном режиме.

source: Warning
ru: Предупреждение

source: Unable to bring the virtual machine '{0}' to front as there is more than one window of the same name.
ru: Невозможно переместить виртуальную машину '{0}' на передний план, так как существует несколько окон с одинаковым именем.

source: Double click to edit a virtual machine's properties.
ru: Щёлкните дважды, чтобы отредактировать свойства виртуальной машины.

source: VirtualBox™ Manager
ru: Менеджер VirtualBox

source: The name (window title) of VirtualBox™ Manager. You may have to adjust for your local language.
ru: Название (заголовок) окна Менеджера VirtualBox. Настройте название для вашего языка.

source: If checked, groups are shown using submenus. Otherwise groups are shown as an indented list.
ru: Если стоит отметка, то группы виртуальных машин отображаются в виде подменю. Иначе группы отображаются в виде списка с отступом.

source: How often the list of virtual machines and running status are updated.
ru: Насколько часто обновляется список виртуальных машин и статус запущенных машин.

source: Amount of time to wait from automatically starting one virtual machine to the next.
ru: Интервал времени после автоматического запуска одной виртуальной машины до запуска следующей.

source: The terminal command to start the virtual machine such as VBoxManage startvm %VM% or VBoxHeadless --startvm %VM% --vrde off
ru: Консольная команда запуска виртуальной машины, например: VBoxManage startvm %VM% или VBoxHeadless --startvm %VM% --vrde off

source: Run the virtual machine when the indicator starts.
ru: Запускать виртуальную машину при старте индикатора.

source: Virtual Machine Properties
ru: Свойства виртуальной машины

source: The start command must contain %VM% which is substituted for the virtual machine name/id.
ru: Команда запуска должна содержать %VM%, этот параметр будет заменён названием или ID виртуальной машины.
