Repository: iconindicators/appindicators
Catalog: trunk/po/*/indicator-ppa-download-statistics.po
Languages: cs

source: Display the total downloads of PPAs.
cs: Zobrazuje celkový počet stažení z PPA repozitářů.

source: (downloading data...)
cs: (stahují se data...)

source: (error retrieving PPA)
cs: (chyba při vyhledávání PPA)

source: (no published binaries)
cs: (žádné uveřejněné binární soubory)

source: (published binaries completely filtered)
cs: (uveřejněné binární soubory jsou zcela vyfiltrovány)

source: translator-credits
cs: Pavel Řehák <pavel-rehak@email.cz>

source: View the
cs: Zobrazit

source: text file.
cs: jako textový soubor.

source: changelog
cs: přehled změn

source: PPA User
cs: Uživatel PPA

source: PPA Name
cs: Název PPA

source: Series
cs: Vydání

source: Architecture
cs: Architektura

source: Double click to edit a PPA.
cs: Dvoujklikem začnete upravovat PPA repozitář.

source: Add
cs: Přidat

source: Add a new PPA.
cs: Přidat nový PPA repozitář.

source: Remove
cs: Odstranit

source: Remove the selected PPA.
cs: Odstranit vybraný PPA repozitář.

source: PPAs
cs: PPA repozitáře

source: Filter
cs: Filtr

source: Double click to edit a filter.
cs: Dvoujklikem začnete upravovat filtr.

source: Add a new filter.
cs: Přidat nový filtr.

source: Remove the selected filter.
cs: Odstranit vybraný filtr.

source: Filters
cs: Filtry

source: Show PPAs as submenus
cs: Zobrazit PPA repozitáře jako podmenu

source: Combine PPAs
cs: Kombinovat PPA repozitáře

source: Ignore version for architecture specific
cs: Ignorovat verze jednotlivých architektur

source: Sort by download
cs: Řadit podle počtu stažení

source: Clip amount
cs: Počet zobrazených řádků

source: Autostart
cs: Automatické spouštění

source: General
cs: Obecné

source: Preferences
cs: Předvolby

source: No PPA has been selected for removal.
cs: Nebyl vybrán PPA repozitář, který se má odstranit.

source: Remove the selected PPA?
cs: Odstranit vybraný PPA repozitář?

source: Edit PPA
cs: Upravit PPA repozitář

source: Add PPA
cs: Přidat PPA repozitář

source: PPA user cannot be empty.
cs: Uživatel PPA nemůže zůstat nevyplněný.

source: PPA name cannot be empty.
cs: Název PPA repozitáře nemůže zůstat nevyplněný.

source: Duplicates disallowed - there is an identical PPA!
cs: Duplicity nejsou povoleny - stejný PPA repozitář již existuje!

source: No filter has been selected for removal.
cs: Nebyl vybrán filtr, který se má odstranit.

source: Remove the selected filter?
cs: Odstranit vybraný filtr?

source: Please add a PPA first!
cs: Nejdříve prosím přidejte PPA repozitář.

source: Only one filter per PPA User/Name.
cs: Pouze jeden filtr na uživatele/název PPA repozitáře.

source: PPA User/Name
cs: Uživatel/název PPA repozitáře.

source: Filter Text
cs: Text filtru

source: Edit Filter
cs: Upravit filtr

source: Add Filter
cs: Přidat filtr

source: Please enter filter text!
cs: Zadejte prosím text filtru!

source: Statistics downloaded!
cs: Statistiky staženy!
