Repository: iconindicators/appindicators
Catalog: trunk/po/*/indicator-stardate.po
Languages: ru

source: Shows the current Star Trek™ stardate.
ru: Показывает текущую звёздную дату "Звёздного пути".

source: Based on STARDATES IN STAR TREK FAQ V1.6 by Andrew Main.
ru: Основано на "STARDATES IN STAR TREK FAQ V1.6", автор Andrew Main.

source: Stardate: {0}
ru: Звёздная дата: {0}

source: Credits
ru: Благодарность

source: Change _Log
ru: Список _изменений

source: translator-credits
ru: Олег Мойсейчук

source: Use 'classic' conversion
ru: "Классическое" преобразование дат

source: Stardate 'classic' is based on STARDATES IN STAR TREK FAQ V1.6 by Andrew Main. Otherwise the 2009 revision is used (http://en.wikipedia.org/wiki/Stardate).
ru: "Классические" звёздные даты основаны на "STARDATES IN STAR TREK FAQ V1.6" автор Andrew Main. Иначе использется ревизия 2009 года (http://en.wikipedia.org/wiki/Stardate).

source: Show ISSUE
ru: Показывать "выпуск"

source: Show the ISSUE of the stardate (only applies to 'classic').
ru: Показывать "выпуск" звёздной даты (касается только "классической" системы).

source: Pad INTEGER
ru: Выравнивать целую часть

source: Pad the INTEGER part with leading zeros (only applies to 'classic').
ru: Дополнять нулями целую часть звёздной даты (касается только "классической" системы).

source: Show in menu
ru: Показывать в меню

source: Show the stardate in the menu. Useful for desktop environments which prohibit text labels adjacent to the icon.
ru: Показывать звёздную дату в меню. Полезно для сред рабочего стола, которые запрещают показ текста рядом со значком.

source: Autostart
ru: Автозапуск

source: Run the indicator automatically.
ru: Запускать индикатор автоматически.

source: Preferences
ru: Параметры
