Repository: iconindicators/appindicators
Catalog: indicator-ppa-download-statistics/po/*/indicator-ppa-download-statistics.po
Languages: ru

source: (error retrieving PPA)
ru: (невозможно найти PPA)

source: (no published binaries)
ru: (нет опубликованных двоичных файлов)

source: (no published binaries and/or completely filtered)
ru: (нет опубликованных двоичных файлов, либо они полностью отфильтрованы)

source: (published binaries completely filtered)
ru: (двоичные файлы полностью отфильтрованы)

source: Display the total downloads of PPAs.
ru: Показать статистику закачек из PPA.

source: PPA User
ru: Пользователь PPA

source: PPA Name
ru: Название PPA

source: Series
ru: Версия

source: Architecture
ru: Архитектура

source: Double click to edit a PPA.
ru: Щёлкните дважды, чтобы отредактировать PPA.

source: Add
ru: Добавить

source: Add a new PPA.
ru: Добавить новый PPA.

source: Remove
ru: Удалить

source: Remove the selected PPA.
ru: Удалить выбранный PPA.

source: PPAs
ru: PPA

source: Filter
ru: Фильтр

source: Double click to edit a filter.
ru: Щёлкните дважды, чтобы отредактировать фильтр.

source: Add a new filter.
ru: Добавить новый фильтр.

source: Remove the selected filter.
ru: Удалить выбранный фильтр.

source: Filters
ru: Фильтры

source: Show PPAs as submenus
ru: Показывать PPA в виде подменю

source: The download statistics for each PPA are shown in a separate submenu.
ru: Статистика загрузок для каждого PPA будет отображаться в отдельном подменю.

source: Combine PPAs
ru: Объединить PPA

source: Combine the statistics of binary packages when the PPA user/name are the same. Non-architecture specific packages: If the package names and version numbers of two binary packages are identical, the packages are treated as the same package and the download counts are NOT summed. Packages such as Python fall into this category. Architecture specific packages: If the package names and version numbers of two binary packages are identical, the packages are treated as the same package and the download counts ARE summed. Packages such as compiled C fall into this category.
ru: Объединить статистику по двоичным пакетам, если пользователь/название PPA совпадают. Для архитектурно-независимых пакетов: если названия пакетов и номера версий двух двоичных пакетов совпадают, пакеты расцениваются как одинаковые, и счётчики закачек НЕ БУДУТ суммироваться. Пакеты с кодом Python попадают в эту категорию. Для архитектурно-зависимых пакетов: если названия пакетов и номера версий двух двоичных пакетов совпадают, пакеты расцениваются как одинаковые, и счётчики закачек БУДУТ суммироваться. Пакеты с компилированным кодом C попадают в эту категорию.

source: Ignore version for architecture specific
ru: Игнорировать версию для архитектурно-зависимых пакетов

source: Sometimes architecture specific packages with the same package name but different version 'number' are logically the SAME package. For example, a C source package for both Ubuntu Saucy and Ubuntu Trusty will be compiled twice, each with a different 'number', despite being the SAME release. Checking this option will ignore the version number when determining if two architecture specific packages are identical. The version number is retained only if it is identical across ALL instances of a published binary.
ru: Иногда зависящие от архитектуры пакеты с одинаковым названием пакета, но различным "номером" версии логически являются одним и тем же пакетом. Например, пакет с исходным кодом на C для Ubuntu Saucy и Ubuntu Trusty будет скомпилирован дважды, с различным "номером" версии, являясь при этом совершенно одинаковым выпуском. Включение этой опции позволит игнорировать номер версии при определении идентичности двух архитектурно-зависимых пакетов. Номер версии учитывается только если он идентичен для ВСЕХ экземпляров опубликованного двоичного пакета.

source: Sort by download
ru: Сортировать по закачкам

source: Sort by download count within each PPA.
ru: Сортировать по количеству закачек в каждом PPA.

source: Clip amount
ru: Ограничить количество

source: Limit the number of entries when sorting by download. A value of zero will not clip.
ru: Ограничить количество выводимых строк при сортировке по количеству закачек. Нулевое значение отключает ограничение.

source: Low bandwidth
ru: Медленное соединение

source: Enable if your internet connection is slow.
ru: Включите, если у вашего Интернет-соединения низкая скорость.

source: General
ru: Общие

source: No PPA has been selected for removal.
ru: Не выбран PPA для удаления.

source: Remove the selected PPA?
ru: Удалить выбранный PPA?

source: Add PPA
ru: Добавить PPA

source: Edit PPA
ru: Редактировать PPA

source: PPA user cannot be empty.
ru: Пользователь PPA не может быть пустым.

source: PPA name cannot be empty.
ru: Название PPA не может быть пустым.

source: Duplicates disallowed - there is an identical PPA!
ru: Дубликаты не допускаются - существует идентичный PPA!

source: No filter has been selected for removal.
ru: Не выбран фильтр для удаления.

source: Remove the selected filter?
ru: Удалить выбранный фильтр?

source: Please add a PPA first!
ru: Пожалуйста, вначале добавьте PPA!

source: Only one filter per PPA User/Name.
ru: Не более одного фильтра для каждого пользователя/названия PPA.

source: PPA User/Name
ru: Пользователь/название PPA

source: Filter Text
ru: Текст фильтра

source: Each line of text is a single filter which is compared against each package during download. If a package name contains ANY part of ANY filter, that package is included in the download statistics. Regular expressions and wild cards are not accepted!
ru: Каждая строка текста представляет собой одиночный шаблон, который сравнивается с каждым названием пакета при загрузке. Если название пакета содержит ЛЮБУЮ часть ЛЮБОГО шаблона, то этот пакет включается в статистику загрузок. Регулярные выражения и символы группировки не допускаются!

source: Edit Filter
ru: Редактировать фильтр

source: Add Filter
ru: Добавить фильтр

source: Please enter filter text!
ru: Пожалуйста, введите текст фильтра!
