Repository: iconindicators/appindicators
Catalog: indicatorscriptrunner/src/indicatorscriptrunner/locale/*/LC_MESSAGES/indicatorscriptrunner.po
Languages: ru

source: Indicator Script Runner
ru: Индикатор запуска сценариев

source: Runs a terminal command or script; optionally display results in the icon label.
ru: Запускает команду или сценарий в терминале; имеет возможность вывода результатов на панель.

source: Cannot run script
ru: Невозможно запустить сценарий

source: Cannot run script as no terminal and/or terminal execution flag found; please install gnome-terminal.
ru: Невозможно запустить сценарий: отсутствует терминал и/или флаг исполнения в терминале; просьба установить gnome-terminal.

source: Cannot run script as qterminal incorrectly parses arguments; install gnome-terminal instead.
ru: Невозможно запустить сценарий: qterminal некорректно обрабатывает аргументы; установите gnome-terminal.

source: ...has completed.
ru: завершился.

source: The text shown next to the indicator icon, or tooltip, where applicable. A background script will only be run if added to the icon text. The result of running a background script will be added to the icon text.
ru: Текст, отображаемый возле значка индикатора или в виде всплывающей подсказки (если возможно). Фоновые сценарии будут запускаться только в том случае, если выводят текст на панель. Результат выполнения фонового сценария будет добавлен к тексту возле значка.

source: The terminal script/command, along with any arguments.
ru: Команда/сценарий с любыми аргументами для запуска в терминале.

source: Add
ru: Добавить

source: Copy
ru: Копировать

source: Remove
ru: Удалить

source: Add a new script.
ru: Добавить новый сценарий.

source: Group
ru: Группа

source: Name
ru: Название

source: Sound
ru: Звук

source: Notification
ru: Уведомление

source: Background
ru: Фоновый

source: Terminal
ru: Терминал

source: Interval
ru: Интервал

source: Force Update
ru: Принудительное обновление

source: Double-click to edit a script. If an attribute does not apply to a script, a dash is displayed. If a non-background script is checked as default, the name will appear in bold.
ru: Двойной щелчок позволяет задать сценарий. Если атрибут не применим к сценарию, то отображается прочерк. Название сценария, заданного по умолчанию, будет отображено жирным шрифтом (кроме фоновых сценариев).

source: Command
ru: Команда

source: Send command to log
ru: Записать команду в журнал

source: When a script is run, send the command to the log (located in your home directory).
ru: При запуске сценария записать полную команду в журнал (находящийся в домашней папке).

source: Scripts
ru: Сценарии

source: Show non-background scripts
ru: Отображать сценарии (кроме фоновых)

source: In sub-menus
ru: В виде подменю

source: Indented by group
ru: В виде групп с отступом

source: Hide groups
ru: Скрыть группы

source: If checked, only script names are displayed. Otherwise, script names are indented within their respective group.
ru: Если включено, то отображаются только названия сценариев. Иначе названия сценариев группируются в виде списка с отступами.

source: Menu
ru: Меню

source: Icon Text
ru: Текст на панели

source: The separator will be added between script tags.
ru: Разделитель, добавляемый между метками сценариев.

source: Separator
ru: Разделитель

source: Double click on a script to add to the icon text.
ru: Щёлкните дважды по сценарию, чтобы добавить текст для панели.

source: Icon
ru: Значок

source: General
ru: Общие

source: Duplicate the selected script.
ru: Создать копию выбранного сценария.

source: Remove the selected script.
ru: Удалить выбранный сценарий.

source: Duplicate the selected group, and all scripts within the group.
ru: Создать копию выбранной группы и всех сценариев в этой группе.

source: Remove the selected group and all scripts within the group.
ru: Удалить выбранную группу и все сценарии в этой группе.

source: Group Name
ru: Название группы

source: Copy Group
ru: Копировать группу

source: The group cannot be empty.
ru: Группа не может быть пустой.

source: The group already exists!
ru: Группа с таким названием уже существует!

source: Choose an existing group or enter a new one.
ru: Выберите существующую группу или создайте новую.

source: Copy Script
ru: Копировать сценарий

source: The name cannot be empty.
ru: Название не может быть пустым.

source: A script of the same group and name already exists!
ru: Сценарий с таким названием и группой уже существует!

source: Remove the selected group and all scripts within the group?
ru: Удалить выбранную группу и все сценарии в этой группе?

source: Remove the selected script?
ru: Удалить выбранный сценарий?

source: Edit Group
ru: Редактировать группу

source: The group to which the script belongs. Choose an existing group or enter a new one.
ru: Группа, к которой принадлежит сценарий. Выберите существующую группу или создайте новую.

source: The name of the script.
ru: Название сценария.

source: Play sound
ru: Воспроизвести звук

source: For non-background scripts, play a sound on script completion. For background scripts, play a sound only if the script returns non-empty text.
ru: Воспроизвести звук по завершении сценария. Для фоновых сценариев -- воспроизвести звук только если сценарий возвращает непустой текст.

source: Show notification
ru: Показать уведомление

source: For non-background scripts, show a notification on script completion. For background scripts, show a notification only if the script returns non-empty text.
ru: Показать уведомление по завершении сценария. Для фоновых сценариев -- показать уведомление только если сценарий возвращает непустой текст.

source: Non-background
ru: Не фоновый

source: Non-background scripts are displayed in the menu and run when the user clicks on the corresponding menu item.
ru: Не фоновые сценарии отображаются в меню и запускаются по нажатию на пункт в меню.

source: Leave terminal open
ru: Оставить терминал открытым

source: Leave the terminal open on script completion.
ru: Оставить терминал открытым по завершении сценария.

source: Default script
ru: Сценарий по умолчанию

source: One script may be set as default which is run on a middle mouse click of the indicator icon. Not supported on all desktops.
ru: Один сценарий может быть выбран как сценарий по умолчанию, который запускается по щелчку средней кнопкой на значке индикатора. Поддерживается не во всех средах рабочего стола.

source: A background script, added to the icon text, will be run at the interval specified. A background script must return a string, which may be empty. Any exception will be logged to a file in the user's home directory and the script's tag will remain in the icon text.
ru: Фоновый сценарий, добавленный к тексту возле значка, будет запускаться с выбранным интервалом. Фоновый сценарий должен возвращать строку, которая может быть пустой. Любое исключение будет занесено в журнал, находящийся в домашней папке пользователя, а метка сценария останется в тексте значка.

source: Interval, in minutes, between runs.
ru: Интервал между запусками в минутах.

source: Force update
ru: Обновлять принудительно

source: Useful for a script which generally returns an empty string, but on occasion returns a message, say, when new mail has arrived, or a log file is present. When force update is enabled, the script will be run on the next update of ANY script, if the script returned a non-empty message.
ru: Может пригодиться для сценариев, которые обычно возвращают пустую строку, но иногда возвращают сообщение (например, о получении почты или наличии файла журнала). При включённом режиме принудительного обновления, если сценарий вернул непустое сообщение, то он будет запущен при следующем запуске ЛЮБОГО сценария.

source: Add Script
ru: Добавить сценарий

source: Edit Script
ru: Редактировать сценарий

source: The command cannot be empty.
ru: Команда не может быть пустой.

source: A script of the same group and name already exists.
ru: Сценарий с таким названием и группой уже существует.

source: No scripts are present. Restore the sample scripts?
ru: Сценарии не найдены. Восстановить исходные сценарии?
